## Requirements

- predict net rate of bike rentals for a give station *rate defined as (trips ended - trips started) / hr
    - expect that the primary factors influencing rate will be:
        - time of day
        - weather
        - station location
- EDA
    - Tableau Top Stations by year https://public.tableau.com/views/BikeShare_16361485366690/Dashboard1?:language=en-US&publish=yes&:display_count=n&:origin=viz_share_link
    
    - Maybe take this guy's advice: https://hrngok.github.io/posts/bay_area%20bike%20data/
- data wrangling

## Data Preparation

In [1]:
import pandas as pd
import datetime as dt

In [2]:
stations = pd.read_csv('../data/station_data.csv')
trips = pd.read_csv('../data/trip_data.csv')
weather = pd.read_csv('../data/weather_data.csv')

### Start by inspecting data

In [3]:
stations.head()

,Id,Name,Lat,Long,Dock Count,City
0,2,San Jose Diridon Caltrain Station,37.329732,-121.901782,27,San Jose
1,3,San Jose Civic Center,37.330698,-121.888979,15,San Jose
2,4,Santa Clara at Almaden,37.333988,-121.894902,11,San Jose
3,5,Adobe on Almaden,37.331415,-121.893200,19,San Jose
4,6,San Pedro Square,37.336721,-121.894074,15,San Jose

In [4]:
stations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76 entries, 0 to 75
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          76 non-null     int64
 1   Name        76 non-null     object
 2   Lat         76 non-null     float64
 3   Long        76 non-null     float64
 4   Dock Count  76 non-null     int64
 5   City        76 non-null     object
dtypes: float64(2), int64(2), object(2)
memory usage: 3.7+ KB

In [5]:
trips.head()

,Trip ID,Start Date,Start Station,End Date,End Station,Subscriber Type
0,913460,31/08/2015 23:26,50,31/08/2015 23:39,70,Subscriber
1,913459,31/08/2015 23:11,31,31/08/2015 23:28,27,Subscriber
2,913455,31/08/2015 23:13,47,31/08/2015 23:18,64,Subscriber
3,913454,31/08/2015 23:10,10,31/08/2015 23:17,8,Subscriber
4,913453,31/08/2015 23:09,51,31/08/2015 23:22,60,Customer

In [6]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 354152 entries, 0 to 354151
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Trip ID          354152 non-null  int64
 1   Start Date       354152 non-null  object
 2   Start Station    354152 non-null  int64
 3   End Date         354152 non-null  object
 4   End Station      354152 non-null  int64
 5   Subscriber Type  354152 non-null  object
dtypes: int64(3), object(3)
memory usage: 16.2+ MB

#### Seems like trips is key to getting net rate per hour if datetime can be restricted to hour

In [7]:
trips['Start Date'] = trips['Start Date'].apply(lambda x: dt.datetime.strptime(x, '%d/%m/%Y %H:%M'))

In [8]:
trips['End Date'] = trips['End Date'].apply(lambda x: dt.datetime.strptime(x, '%d/%m/%Y %H:%M'))

In [9]:
trips['Start Date hr'] = trips['Start Date'].apply(lambda x: dt.datetime(x.year, x.month, x.day, x.hour))

In [10]:
trips['End Date hr'] = trips['End Date'].apply(lambda x: dt.datetime(x.year, x.month, x.day, x.hour))

#### Now I need to calculate the net bikes in and out

In [11]:
bikes_out_df = trips.groupby(['Start Station', 'Start Date hr']).count()['Trip ID'].reset_index()

In [12]:
bikes_out_df.rename(columns={"Start Station": "station", "Start Date hr": "Date hr", 'Trip ID': 'count'}, inplace=True)

In [13]:
bikes_in_df = trips.groupby(['End Station', 'End Date hr']).count()['Trip ID'].reset_index()

In [14]:
bikes_in_df.rename(columns={"End Station": "station", "End Date hr": "Date hr", 'Trip ID': 'count'}, inplace=True)

#### Combining the bikes-in and bikes-out data frames to get the net count per hour

In [15]:
net_bikes = bikes_in_df.merge(bikes_out_df, how='outer', on=['station', 'Date hr'],
                  suffixes=('_bikes_in', '_bikes_out'))

In [16]:
net_bikes

        station             Date hr  count_bikes_in  count_bikes_out
0             2 2014-09-01 14:00:00             1.0              NaN
1             2 2014-09-02 06:00:00             3.0              NaN
2             2 2014-09-02 07:00:00             6.0              3.0
3             2 2014-09-02 08:00:00             1.0              2.0
4             2 2014-09-02 09:00:00             2.0              3.0
...         ...                 ...             ...              ...
198151       90 2015-08-30 13:00:00             NaN              1.0
198152       90 2015-08-30 17:00:00             NaN              2.0
198153       90 2015-08-30 19:00:00             NaN              2.0
198154       90 2015-08-31 12:00:00             NaN              1.0
198155       90 2015-08-31 20:00:00             NaN              1.0

[198156 rows x 4 columns]

In [17]:
net_bikes.fillna(0, inplace= True)

In [18]:
net_bikes['net rate'] = net_bikes['count_bikes_in'] - net_bikes['count_bikes_out']

In [19]:
net_bikes

        station             Date hr  count_bikes_in  count_bikes_out  net rate
0             2 2014-09-01 14:00:00             1.0              0.0       1.0
1             2 2014-09-02 06:00:00             3.0              0.0       3.0
2             2 2014-09-02 07:00:00             6.0              3.0       3.0
3             2 2014-09-02 08:00:00             1.0              2.0      -1.0
4             2 2014-09-02 09:00:00             2.0              3.0      -1.0
...         ...                 ...             ...              ...       ...
198151       90 2015-08-30 13:00:00             0.0              1.0      -1.0
198152       90 2015-08-30 17:00:00             0.0              2.0      -2.0
198153       90 2015-08-30 19:00:00             0.0              2.0      -2.0
198154       90 2015-08-31 12:00:00             0.0              1.0      -1.0
198155       90 2015-08-31 20:00:00             0.0              1.0      -1.0

[198156 rows x 5 columns]

#### Using the net rate column as a target should serve for a simple linear regression model

In [20]:
net_bikes.to_csv('../data/net_bikes.csv', index=False)

### The model could be expanded by joining net_bikes to weather on date to account for conditions

In [21]:
weather.head()

,Date,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,MeanDew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,...,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees,Zip
0,01/09/2014,83.0,70.0,57.0,58.0,56.0,52.0,86.0,64.0,42.0,...,10.0,8.0,16.0,7.0,20.0,0.0,0.0,NaN,290.0,94107
1,02/09/2014,72.0,66.0,60.0,58.0,57.0,55.0,84.0,73.0,61.0,...,10.0,7.0,21.0,8.0,NaN,0.0,5.0,NaN,290.0,94107
2,03/09/2014,76.0,69.0,61.0,57.0,56.0,55.0,84.0,69.0,53.0,...,10.0,10.0,21.0,8.0,24.0,0.0,4.0,NaN,276.0,94107
3,04/09/2014,74.0,68.0,61.0,57.0,57.0,56.0,84.0,71.0,57.0,...,10.0,8.0,22.0,8.0,25.0,0.0,5.0,NaN,301.0,94107
4,05/09/2014,72.0,66.0,60.0,57.0,56.0,54.0,84.0,71.0,57.0,...,9.0,7.0,18.0,8.0,32.0,0.0,4.0,NaN,309.0,94107

In [22]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1825 entries, 0 to 1824
Data columns (total 24 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Date                       1825 non-null   object
 1   Max TemperatureF           1821 non-null   float64
 2   Mean TemperatureF          1821 non-null   float64
 3   Min TemperatureF           1821 non-null   float64
 4   Max Dew PointF             1775 non-null   float64
 5   MeanDew PointF             1775 non-null   float64
 6   Min DewpointF              1775 non-null   float64
 7   Max Humidity               1775 non-null   float64
 8   Mean Humidity              1775 non-null   float64
 9   Min Humidity               1775 non-null   float64
 10  Max Sea Level PressureIn   1824 non-null   float64
 11  Mean Sea Level PressureIn  1824 non-null   float64
 12  Min Sea Level PressureIn   1824 non-null   float64
 13  Max VisibilityMiles        1820 non-null   float64
 14  Mean VisibilityMiles       1820 non-null   float64
 15  Min VisibilityMiles        1820 non-null   float64
 16  Max Wind SpeedMPH          1824 non-null   float64
 17  Mean Wind SpeedMPH         1824 non-null   float64
 18  Max Gust SpeedMPH          1284 non-null   float64
 19  PrecipitationIn            1824 non-null   float64
 20  CloudCover                 1824 non-null   float64
 21  Events                     287 non-null    object
 22  WindDirDegrees             1824 non-null   float64
 23  Zip                        1825 non-null   int64
dtypes: float64(21), int64(1), object(2)
memory usage: 342.3+ KB